---
title: AssemblyMemberDifferentType
classe: Autodesk.Revit.DB.AssemblyMemberDifferentType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.AssemblyMemberDifference
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# AssemblyMemberDifferentType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId TypeId1 { get; }` | `assemblyMemberDifferentType.TypeId1` | ElementId |
| `ElementId TypeId2 { get; }` | `assemblyMemberDifferentType.TypeId2` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```